nxp-mcuxpresso/mcux-soc-svd/MCXW727C/MCXW727C_cm33_core1.xml
        <register>
          <name>BTU_RIF_ARB_CTL_1</name>
          <description>RIF ARB Control</description>
          <addressOffset>0xCCA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>eq_pri_winner_Hi</name>
              <description>Arbitration rule for if BTC, BLE and ANT packet are same High priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>BTC &gt; BLE &gt; ANT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>BLE &gt; BTC &gt; ANT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>BTC &gt; ANT &gt; BLE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>BLE &gt; ANT &gt; BTC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v4</name>
                  <description>ANT &gt; BTC &gt; BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5</name>
                  <description>ANT &gt; BLE &gt; BTC</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v6</name>
                  <description>Simple Round Robin</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_Hi_cutoff_dis</name>
              <description>Disable Hi priority packet cutoff</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_winner_MH</name>
              <description>Arbitration rule for if BTC, BLE and ANT packet are same MH priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>BTC &gt; BLE &gt; ANT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>BLE &gt; BTC &gt; ANT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>BTC &gt; ANT &gt; BLE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>BLE &gt; ANT &gt; BTC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v4</name>
                  <description>ANT &gt; BTC &gt; BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5</name>
                  <description>ANT &gt; BLE &gt; BTC</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v6</name>
                  <description>Simple Round Robin</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_MH_cutoff_dis</name>
              <description>Disable MH priority packet cutoff</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_winner_ML</name>
              <description>Arbitration rule for if BTC, BLE and ANT packet are same ML priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>BTC &gt; BLE &gt; ANT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>BLE &gt; BTC &gt; ANT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>BTC &gt; ANT &gt; BLE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>BLE &gt; ANT &gt; BTC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v4</name>
                  <description>ANT &gt; BTC &gt; BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5</name>
                  <description>ANT &gt; BLE &gt; BTC</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v6</name>
                  <description>Simple Round Robin</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_ML_cutoff_dis</name>
              <description>Disable ML priority packet cutoff</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_winner_Lo</name>
              <description>Arbitration rule for if BTC, BLE and ANT packet are same Low priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>BTC &gt; BLE &gt; ANT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>BLE &gt; BTC &gt; ANT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>BTC &gt; ANT &gt; BLE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>BLE &gt; ANT &gt; BTC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v4</name>
                  <description>ANT &gt; BTC &gt; BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v5</name>
                  <description>ANT &gt; BLE &gt; BTC</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v6</name>
                  <description>Simple Round Robin</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>eq_pri_Lo_cutoff_dis</name>
              <description>Disable Lo priority packet cutoff</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TESTBUS_SEL_0</name>
          <description>RIF Testbus Select 0</description>
          <addressOffset>0xCD0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_sel_0</name>
              <description>RIF Testbus Select, Lower Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>get btc_testbus_out[i]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>get ble_testbus_out[i]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>get ble_debug_sw_msg_out(URAT)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>get ble_test_sw_out[i]</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TESTBUS_SEL_1</name>
          <description>RIF Testbus Select 1</description>
          <addressOffset>0xCD2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_sel_1</name>
              <description>RIF Testbus Select, Upper Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>get btc_testbus_out[i]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>get ble_testbus_out[i]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v2</name>
                  <description>get ble_debug_sw_msg_out(URAT)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v3</name>
                  <description>get ble_test_sw_out[i]</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TESTBUS_OE</name>
          <description>BTU Testbus Output Enable</description>
          <addressOffset>0xCD4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_testbus_oe_</name>
              <description>Debug testbus output enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_REG_DEBUG_SW_OUTDATA</name>
          <description>BLE Debug Output Data</description>
          <addressOffset>0xCD6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_sw_out</name>
              <description>BLE debug software control testbus ouput</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_REG_DEBUG_INDATA</name>
          <description>BLE Debug Input Data</description>
          <addressOffset>0xCD8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_in</name>
              <description>BLE debug testbus input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_REG_DEBUG_SW_MSG</name>
          <description>BLE Debug Software Message</description>
          <addressOffset>0xCDA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DEBUG_SW_MSG</name>
              <description>Debug message</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_REG_DEBUG_SW_MSG_FIFO_CNT</name>
          <description>BLE Debug Software Message FIFO Count</description>
          <addressOffset>0xCDC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_REG_DEBUG_SW_MSG_FIFO_CNT</name>
              <description>Debug message FIFO count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TESTBUS_CONTROL</name>
          <description>RIF Testbus Control</description>
          <addressOffset>0xCDE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTU_RIF_TESTBUS_CONTROL</name>
              <description>Testbus bank rotation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BT_CLK_GATING</name>
          <description>RIF Bluetooth Clock Gating</description>
          <addressOffset>0xCF0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_btc_force_clk_en</name>
              <description>BTC Force Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_aes_clk_en</name>
              <description>AES Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_rif_rx_4m_clk_en</name>
              <description>RIF Rx 4M Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>rif_rx_4m_clk_en controls clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces rif_rx_4m_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_rif_rx_16m_clk_en</name>
              <description>RIF Rx 16M Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>rif_rx_16m_clk_en controls clock gating for rif_rx_16m_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces rif_rx_16m_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_btc_force_clk_one</name>
              <description>BTC Force Clock One</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_btc_force_clk_zero</name>
              <description>BTC Force Clock Zero</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_force_ebram_sysclk_en</name>
              <description>Force EBRAM ebSysClk enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btc_clk_req_early_assert</name>
              <description>BTC_clk_req early assertion upon any BTC AHB access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lcClkEnOut_early_ungate</name>
              <description>lcClkEnOut early upgated upon any BTC AHB access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btc_sys_4m_early_ungate</name>
              <description>BTC_sys_clk and btc_4m_clk early ungated upon any BTC AHB access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_CLK_SMPLD</name>
          <description>RIF Clock Sampled</description>
          <addressOffset>0xCF4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_4m_smpld_mux</name>
              <description>4M Sampled MUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_rx_4m_smpld_mux</name>
              <description>RIF Rx 4M Sampled MUX</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lpoClk_smpld_mux</name>
              <description>LPO Clock Sampled MUX</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>selects old way for lpoClkSmpld signal generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>selects new way for lpoClkSmpls signal generation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
