nxp-mcuxpresso/mcux-soc-svd/MCXW727C/MCXW727C_cm33_core1.xml
        <register>
          <name>RSM_INT_STATUS</name>
          <description>Ranging Sequence Manager interrupt status</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>RSM_IRQ_EOS</name>
              <description>RSM_IRQ_EOS Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_ABORT</name>
              <description>RSM_IRQ_ABORT Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_IP1</name>
              <description>RSM_IRQ_IP1 Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_IP2</name>
              <description>RSM_IRQ_IP2 Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_FC</name>
              <description>RSM_IRQ_FC Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_FM_RX</name>
              <description>RSM_IRQ_FM_RX Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_FM_TX</name>
              <description>RSM_IRQ_FM_TX Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_PM_RX</name>
              <description>RSM_IRQ_PM_RX Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_PM_TX</name>
              <description>RSM_IRQ_PM_TX Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_DT_RX</name>
              <description>RSM_IRQ_DT_RX Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_DT_TX</name>
              <description>RSM_IRQ_DT_TX Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RSM_IRQ_STEP</name>
              <description>RSM_IRQ_STEP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_RISE</name>
              <description>RSM_IRQ_RF_DENY_RISE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_FALL</name>
              <description>RSM_IRQ_RF_DENY_FALL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_BTA</name>
              <description>RSM_IRQ_RF_DENY_BTA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_INT_ENABLE</name>
          <description>Ranging Sequence Manager interrupt enable</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_IRQ_EOS_EN</name>
              <description>RSM_IRQ_EOS_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_ABORT_EN</name>
              <description>RSM_IRQ_ABORT_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_IP1_EN</name>
              <description>RSM_IRQ_IP1_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_IP2_EN</name>
              <description>RSM_IRQ_IP2_EN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_FC_EN</name>
              <description>RSM_IRQ_FC_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_FM_RX_EN</name>
              <description>RSM_IRQ_FM_RX_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_FM_TX_EN</name>
              <description>RSM_IRQ_FM_TX_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_PM_RX_EN</name>
              <description>RSM_IRQ_PM_RX_EN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_PM_TX_EN</name>
              <description>RSM_IRQ_PM_TX_EN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_DT_RX_EN</name>
              <description>RSM_IRQ_DT_RX_EN</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_DT_TX_EN</name>
              <description>RSM_IRQ_DT_TX_EN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_IRQ_STEP_EN</name>
              <description>RSM_IRQ_STEP_EN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_RISE_EN</name>
              <description>XCVR_IRQ_RF_DENY_RISE_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_FALL_EN</name>
              <description>XCVR_IRQ_RF_DENY_FALL_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR_IRQ_RF_DENY_BTA_EN</name>
              <description>XCVR_IRQ_RF_DENY_BTA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_MASK_CTRL</name>
          <description>DMA_MASK management</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_MASK_CENTER</name>
              <description>DMA_MASK centering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_0</name>
                  <description>No centering</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_1</name>
                  <description>1 us centered window</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_2</name>
                  <description>2 us centered window</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_3</name>
                  <description>4 us centered window</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_4</name>
                  <description>8 us centered window</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_5</name>
                  <description>16 us centered window</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_6</name>
                  <description>32 us centered window</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_7</name>
                  <description>64 us centered window</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_8</name>
                  <description>128 us centered window</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_9</name>
                  <description>256 us centered window</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_10</name>
                  <description>512 us centered window</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_MASK_CENTER_11</name>
                  <description>1024 us centered window</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_SIGNAL_VALID_MASK_SEL</name>
              <description>MASK selection for DMA engine during RX data capture</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_SIGNAL_VALID_MASK_SEL</name>
              <description>MASK selection for DBG engine during RX data capture</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_DFT_CTRL</name>
          <description>RF DFT CTRL</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO_DFT_MODE</name>
              <description>Radio DFT mode control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_0</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_1</name>
                  <description>Carrier Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_2</name>
                  <description>Pattern Register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_3</name>
                  <description>LFSR</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_4</name>
                  <description>RAM Modulation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_10</name>
                  <description>Coarse Tune BIST, no modulation</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_11</name>
                  <description>PLL Locking BIST, no modulation</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_DFT_MODE_12</name>
                  <description>HPM DAC Cal BIST, no modulation</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_ADDR[%s]</name>
          <description>IPS FAST OVERWRITE ADDRESS</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>IPS Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENTRY_RX</name>
              <description>Enable Entry for RX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENTRY_TX</name>
              <description>Enable Entry for TX</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_DRS0_DATA[%s]</name>
          <description>IPS FAST OVERWRITE DRS0 DATA</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRS0_DATA</name>
              <description>Fast Overwrite DRS0 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPS_FO_DRS1_DATA[%s]</name>
          <description>IPS FAST OVERWRITE DRS1 DATA</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRS1_DATA</name>
              <description>Fast Overwrite DRS1 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CONFIG_BUFF</name>
          <description>Ranging Sequence Manager Configuration Buffer</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_CONFIG_BASE_ADDR</name>
              <description>RSM CONFIG BUFFER BASE ADDRESS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_CONFIG_BUFF_LOC</name>
              <description>RSM CONFIG BUFFER LOCATION</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_CONFIG_BUFF_LOC_0</name>
                  <description>located in Tx Packet RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_CONFIG_BUFF_LOC_1</name>
                  <description>located in Rx Packet RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_CONFIG_DEPTH</name>
              <description>RSM CONFIG BUFFER DEPTH</description>
              <bitOffset>15</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_INT_NBSTEP</name>
              <description>RSM INTERRUPT STEP NUMBER</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_CONFIG_PTR</name>
          <description>Ranging Sequence Manager Config Pointer</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_CONFIG_WR_PTR</name>
              <description>RSM CONFIG WRITE POINTER</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_CONFIG_WR_PAGE</name>
              <description>RSM CONFIG WRITE PAGE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_CONFIG_START_PTR</name>
              <description>RSM CONFIG START POINTER</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSM_RESULT_BUFF</name>
          <description>Ranging Sequence Manager Result Buffer</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSM_RESULT_BASE_ADDR</name>
              <description>RSM RESULT BUFFER BASE ADDRESS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSM_RESULT_BUFF_LOC</name>
              <description>RSM RESULT BUFFER LOCATION</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSM_RESULT_BUFF_LOC_0</name>
                  <description>located in TX Packet RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSM_RESULT_BUFF_LOC_1</name>
                  <description>located in RX Packet RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSM_RESULT_DEPTH</name>
              <description>RSM RESULT BUFFER DEPTH</description>
              <bitOffset>15</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
